Documents/ВозвратТовараОтПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВозвратТовараОтПокупателя</Name>
			<Comment>Возврат проданного товара от покупателя</Comment>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БонусыКонтрагентов</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиВВалюте</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусовКНачислениюПоДисконтнойКарте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаАванса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйУчитыватьБонусы</Name>
					<Comment>Служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйУчетБонусовПоДисконтнымКартам</Name>
					<Comment>Служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйВидБонуснойСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыБонусныхСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БонусыКНачислению</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОпределенияСебестоимости</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОпределенияСебестоимостиПоВозвратам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПродажи</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СебестоимостьЗаЕдиницу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомпенсацияПоВозврату</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыКомпенсацииПоВозврату</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UDS_ДатаОперации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UDS_ИдентификаторОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗачетАванса</Name>
					<Comment>#12822</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСКонтрагентамиВВалюте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентамиВВалюте</Name>
			<Comment>Взаиморасчеты с контрагентами в валюте</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВариантыОпределенияСебестоимостиПоВозвратам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВариантыОпределенияСебестоимостиПоВозвратам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РучноеУказание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДокументуПродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВозвратТовараОтПокупателя/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
		
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		ЗаполнитьПоРеализации(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда 
		ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения);		
		
	//#12229
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		ЗаполнитьПоПКО(ДанныеЗаполнения);
		
	КонецЕсли;
	
	СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(ЭтотОбъект, , Ложь);

	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты(); 
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""Склад""!", ЭтотОбъект, "Склад", , Отказ);
	КонецЕсли;

	Для каждого СтрокаТабличнойЧасти из Товары Цикл
		Если СтрокаТабличнойЧасти.ВариантОпределенияСебестоимости = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи Тогда   // #12822
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЗаказПокупателя) И НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДокументПродажи) Тогда
				ТекстСообщения = "В строке " + СтрокаТабличнойЧасти.НомерСтроки + " не указан документ продажи при заполненном заказе покупателя!";
				ПолеДанных = "Товары[" + Строка(СтрокаТабличнойЧасти.НомерСтроки-1) + "].ДокументПродажи";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ПолеДанных, ,Отказ);
			КонецЕсли;
		КонецЕсли;
	
		Если СтрокаТабличнойЧасти.ВариантОпределенияСебестоимости = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи
			И НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДокументПродажи) Тогда
			ТекстСообщения = "В строке " + СтрокаТабличнойЧасти.НомерСтроки + " не указан документ продажи при варианте определения себестоимости по документу продажи!";
			ПолеДанных = "Товары[" + Строка(СтрокаТабличнойЧасти.НомерСтроки-1) + "].ДокументПродажи";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ПолеДанных, ,Отказ);
		КонецЕсли;
		
		// #12822
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЗаказПокупателя) И НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.КомпенсацияПоВозврату) Тогда
			ТекстСообщения = "В строке " + СтрокаТабличнойЧасти.НомерСтроки + " не указан вариант компенсации по возврату при заполненном заказе покупателя!";
			ПолеДанных = "Товары[" + Строка(СтрокаТабличнойЧасти.НомерСтроки-1) + "].КомпенсацияПоВозврату";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ПолеДанных, ,Отказ);
		КонецЕсли;
		
		//++ #13232
		Если СтрокаТабличнойЧасти.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
			ТекстСообщения = "В строке " + СтрокаТабличнойЧасти.НомерСтроки + " выбрана номенклатура-услуга!";
			ПолеДанных = "Товары[" + Строка(СтрокаТабличнойЧасти.НомерСтроки-1) + "].Номенклатура";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ПолеДанных, ,Отказ);
		КонецЕсли;
		//-- #13232

	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаАванса = ПолучитьСуммуЗачета();
	
	Документы.ЗаказПокупателя.ПроверитьЗаполнениеНаОснованииЗаказа(ЭтотОбъект, Отказ, РежимЗаписи);
	
	// контроль остатков
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ВозвратПоПродажамИЗаказам = Товары.Выгрузить();
		ВозвратПоПродажамИЗаказам.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,СерияНоменклатуры,ДокументПродажи,ЗаказПокупателя,Коэффициент", "Количество");
		ВозвратПоПродажам = ВозвратПоПродажамИЗаказам.Скопировать();
		ВозвратПоПродажам.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,СерияНоменклатуры,ДокументПродажи,Коэффициент", "Количество");
		ВозвратПоЗаказам = ВозвратПоПродажамИЗаказам.Скопировать();
		ВозвратПоЗаказам.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,СерияНоменклатуры,ЗаказПокупателя,Коэффициент", "Количество");

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПродажиОбороты.Номенклатура КАК Номенклатура,
		|	ПродажиОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ПродажиОбороты.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ПродажиОбороты.ДокументПродажи КАК ДокументПродажи,
		|	ПродажиОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
		|	СУММА(ПродажиОбороты.КоличествоОборот) КАК Количество
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(, , Регистратор, ) КАК ПродажиОбороты
		|ГДЕ
		|	ПродажиОбороты.Регистратор <> &Регистратор
		|	И (ПродажиОбороты.ДокументПродажи В (&МассивДокументовПродажи)
		//#12822 Разрешить проводить возврат если не указан заказ покупателя в строках, даже если РТиУ по заказу покупателя
		//|	И ПродажиОбороты.ЗаказПокупателя В (&МассивЗаказов))
		|	ИЛИ ПродажиОбороты.ЗаказПокупателя В (&МассивЗаказов))
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиОбороты.Номенклатура,
		|	ПродажиОбороты.ХарактеристикаНоменклатуры,
		|	ПродажиОбороты.СерияНоменклатуры,
		|	ПродажиОбороты.ДокументПродажи,
		|	ПродажиОбороты.ЗаказПокупателя";
		
		Запрос.УстановитьПараметр("Регистратор", Ссылка);
		Запрос.УстановитьПараметр("МассивДокументовПродажи", ВозвратПоПродажам.ВыгрузитьКолонку("ДокументПродажи"));
		Запрос.УстановитьПараметр("МассивЗаказов", ВозвратПоЗаказам.ВыгрузитьКолонку("ЗаказПокупателя"));
		ТаблицаПродажРЗ = Запрос.Выполнить().Выгрузить();

		// сначала проверяем по связке РТИУ - ЗП
		Для каждого СтрокаТабличнойЧасти из ВозвратПоПродажамИЗаказам Цикл
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЗаказПокупателя) И ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДокументПродажи) Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("Номенклатура", 				 СтрокаТабличнойЧасти.Номенклатура);
				Отбор.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
				Отбор.Вставить("СерияНоменклатуры", 		 СтрокаТабличнойЧасти.СерияНоменклатуры);
				Отбор.Вставить("ДокументПродажи", 			 СтрокаТабличнойЧасти.ДокументПродажи);
				Отбор.Вставить("ЗаказПокупателя", 			 СтрокаТабличнойЧасти.ЗаказПокупателя);
				
				НайденныеСтроки = ТаблицаПродажРЗ.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() > 0 Тогда
					Если СтрокаТабличнойЧасти.Количество*СтрокаТабличнойЧасти.Коэффициент > НайденныеСтроки[0].Количество Тогда
						ТекстОшибки = "По позиции """ + СтрокаТабличнойЧасти.Номенклатура + ОбщийМодульСервер.ПредставлениеХарактеристики(СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры) + 
									  """ возвращается (" + СтрокаТабличнойЧасти.Количество*СтрокаТабличнойЧасти.Коэффициент + ") больше, чем продано (" + НайденныеСтроки[0].Количество + ")";
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, , ,Отказ);
					КонецЕсли;
				Иначе
					ТекстОшибки = "По позиции """ + СтрокаТабличнойЧасти.Номенклатура + ОбщийМодульСервер.ПредставлениеХарактеристики(СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры) + 
									  """ отсутствуют данные по продажам в указанных документах";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, , ,Отказ);
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		
		// проверяем по РТИУ
		Если НЕ Отказ Тогда
			ТаблицаПродаж = ТаблицаПродажРЗ.Скопировать();
			ТаблицаПродаж.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,СерияНоменклатуры,ДокументПродажи", "Количество");
			Для каждого СтрокаТабличнойЧасти из ВозвратПоПродажам Цикл
				Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДокументПродажи) Тогда
					Отбор = Новый Структура;
					Отбор.Вставить("Номенклатура", 				 СтрокаТабличнойЧасти.Номенклатура);
					Отбор.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
					Отбор.Вставить("СерияНоменклатуры", 		 СтрокаТабличнойЧасти.СерияНоменклатуры);
					Отбор.Вставить("ДокументПродажи", 			 СтрокаТабличнойЧасти.ДокументПродажи);
					
					НайденныеСтроки = ТаблицаПродаж.НайтиСтроки(Отбор);
					Если НайденныеСтроки.Количество() > 0 Тогда
						Если СтрокаТабличнойЧасти.Количество*СтрокаТабличнойЧасти.Коэффициент > НайденныеСтроки[0].Количество Тогда
							ТекстОшибки = "По позиции """ + СтрокаТабличнойЧасти.Номенклатура + ОбщийМодульСервер.ПредставлениеХарактеристики(СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры) + 
											""" возвращается (" + СтрокаТабличнойЧасти.Количество*СтрокаТабличнойЧасти.Коэффициент + ") больше, чем продано (" + НайденныеСтроки[0].Количество + ")";
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, , ,Отказ);
						КонецЕсли;
					Иначе
						ТекстОшибки = "По позиции """ + СтрокаТабличнойЧасти.Номенклатура + ОбщийМодульСервер.ПредставлениеХарактеристики(СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры) + 
										""" отсутствуют данные по продажам в указанных документах";
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, , ,Отказ);
					КонецЕсли;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
		
		// проверяем по ЗП
		Если НЕ Отказ Тогда
			ТаблицаПродаж = ТаблицаПродажРЗ.Скопировать();
			ТаблицаПродаж.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,СерияНоменклатуры,ЗаказПокупателя", "Количество");
			Для каждого СтрокаТабличнойЧасти из ВозвратПоЗаказам Цикл
				Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЗаказПокупателя) Тогда
					Отбор = Новый Структура;
					Отбор.Вставить("Номенклатура", 				 СтрокаТабличнойЧасти.Номенклатура);
					Отбор.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
					Отбор.Вставить("СерияНоменклатуры", 		 СтрокаТабличнойЧасти.СерияНоменклатуры);
					Отбор.Вставить("ЗаказПокупателя", 			 СтрокаТабличнойЧасти.ЗаказПокупателя);
					
					НайденныеСтроки = ТаблицаПродаж.НайтиСтроки(Отбор);
					Если НайденныеСтроки.Количество() > 0 Тогда
						Если СтрокаТабличнойЧасти.Количество*СтрокаТабличнойЧасти.Коэффициент > НайденныеСтроки[0].Количество Тогда
							ТекстОшибки = "По позиции """ + СтрокаТабличнойЧасти.Номенклатура + ОбщийМодульСервер.ПредставлениеХарактеристики(СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры) + 
											""" возвращается (" + СтрокаТабличнойЧасти.Количество*СтрокаТабличнойЧасти.Коэффициент + ") больше, чем продано (" + НайденныеСтроки[0].Количество + ")";
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, , ,Отказ);
						КонецЕсли;
					Иначе
						ТекстОшибки = "По позиции """ + СтрокаТабличнойЧасти.Номенклатура + ОбщийМодульСервер.ПредставлениеХарактеристики(СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры) + 
										""" отсутствуют данные по продажам в указанных документах";
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, , ,Отказ);
					КонецЕсли;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
	
	КонецЕсли;
	
	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПередЗаписью(ЭтотОбъект, РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// Проверка заполненности склада при проведении (в т.ч. при программном проведении).
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""Склад""!", ЭтотОбъект, "Склад", , Отказ);
		Возврат;
	КонецЕсли;

	ВалютаУчета = ПолучитьФункциональнуюОпцию("ВалютаУчета"); //Константы.ВалютаУчета.Получить();
	
	ОрганизацияТоваров = Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;     
	
	РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("РазрешеноПроводитьДокументВозвратТоваровОтПокупателяБезПроверкиСроковВозврата");  //nva
	//nva+++
	Если ПревышенСрокВозврата() И НЕ РеквизитыПользователя.РазрешеноПроводитьДокументВозвратТоваровОтПокупателяБезПроверкиСроковВозврата Тогда
		Отказ = Истина;
		Возврат;       
	КонецЕсли;
	//nva---
	МассивДокументовПродажи = Товары.ВыгрузитьКолонку("ДокументПродажи");
	ТаблицаСебестоимости = ОбщийМодульСервер.ТаблицаСебестоимостиПродаж(МассивДокументовПродажи);
	//ТаблицаСебестоимости = Новый ТаблицаЗначений;
	//Если МассивДокументовПродажи.Количество() > 0 Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура,
	//	|	ТоварыНаСкладахОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//	|	ТоварыНаСкладахОбороты.СерияНоменклатуры КАК СерияНоменклатуры,
	//	|	ТоварыНаСкладахОбороты.Регистратор КАК Регистратор,
	//	|	ТоварыНаСкладахОбороты.КоличествоРасход КАК Количество,
	//	|	ТоварыНаСкладахОбороты.СуммаРасход КАК Сумма,
	//	|	ВЫБОР
	//	|		КОГДА НЕ ТоварыНаСкладахОбороты.КоличествоРасход = 0
	//	|			ТОГДА ТоварыНаСкладахОбороты.СуммаРасход / ТоварыНаСкладахОбороты.КоличествоРасход
	//	|		ИНАЧЕ 0
	//	|	КОНЕЦ КАК Цена,
	//	|	ВЫБОР
	//	|		КОГДА НЕ ТоварыНаСкладахОбороты.КоличествоРасход = 0
	//	|			ТОГДА ТоварыНаСкладахОбороты.СуммаВалРасход / ТоварыНаСкладахОбороты.КоличествоРасход
	//	|		ИНАЧЕ 0
	//	|	КОНЕЦ КАК ЦенаВал
	//	|ИЗ
	//	|	РегистрНакопления.ТоварыНаСкладах.Обороты(, , Регистратор, ) КАК ТоварыНаСкладахОбороты
	//	|ГДЕ
	//	|	ТоварыНаСкладахОбороты.Регистратор В(&МассивДокументовПродажи)";
	//	
	//	Запрос.УстановитьПараметр("МассивДокументовПродажи", МассивДокументовПродажи);
	//	ТаблицаСебестоимости = Запрос.Выполнить().Выгрузить();
	//КонецЕсли;

	// регистр ТоварыНаСкладах
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Для Каждого Товар Из Товары Цикл
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(Товар.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		Приход = Движения.ТоварыНаСкладах.Добавить();
		Приход.ВидДвижения = ВидДвиженияНакопления.Приход;
		Приход.Период = Дата;
		Приход.Организация = ОрганизацияТоваров;
		Приход.Склад = Склад;
		Приход.Номенклатура = Товар.Номенклатура;
		Приход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
		Приход.СерияНоменклатуры = Товар.СерияНоменклатуры;
		Приход.Количество = Товар.Количество * Товар.Коэффициент;
		
		//Если ЗначениеЗаполнено(Товар.ДокументПродажи) Тогда
		Если Товар.ВариантОпределенияСебестоимости = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи Тогда
			Если ТаблицаСебестоимости.Количество() > 0 Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("Номенклатура", 				 Товар.Номенклатура);
				Отбор.Вставить("ХарактеристикаНоменклатуры", Товар.ХарактеристикаНоменклатуры);
				Отбор.Вставить("СерияНоменклатуры", 		 Товар.СерияНоменклатуры);
				Отбор.Вставить("Регистратор", 				 Товар.ДокументПродажи);
				
				НайденныеСтроки = ТаблицаСебестоимости.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() > 0 Тогда
					Приход.Сумма = НайденныеСтроки[0].Цена * Приход.Количество;
					Приход.Суммавал = НайденныеСтроки[0].ЦенаВал * Приход.Количество;
				Иначе
					Приход.Сумма = 0; //РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Товар.Сумма);
				КонецЕсли;
			Иначе
				Приход.Сумма = 0; //РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Товар.Сумма);
			КонецЕсли;
		Иначе
			Если Товар.СебестоимостьЗаЕдиницу <> 0 Тогда
				Приход.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Товар.СебестоимостьЗаЕдиницу * Приход.Количество);
				Приход.СуммаВал = РаботаСВалютой.ПолучитьСуммуВДопВалютеУчетаПоДокументу(Ссылка, Товар.СебестоимостьЗаЕдиницу * Приход.Количество); //#8288
			Иначе
				Приход.Сумма = 0; //РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Товар.Сумма);
			КонецЕсли;			
		КонецЕсли;
		
	КонецЦикла;
	
	//запись взаиморасчетов
	ВремСуммаДокумента = 0;
	ВремСуммаДокумента = Товары.Итог("Сумма");
	Если НЕ Движения.ВзаиморасчетыСКонтрагентами.ВыполнитьРасход(Ссылка, Организация, Контрагент, ДоговорКонтрагента, ВремСуммаДокумента) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//Взаиморасчеты с контрагентами в валюте
	Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Записывать = Истина;
	Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
	Движение.ВидДвижения =ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Контрагент = Контрагент;
	Движение.Договор = ДоговорКонтрагента;
	Движение.Валюта = Валюта;
	Движение.Сумма = СуммаДокумента;
	
	//продажи
	//ТаблицаПоЗаказам = ПолучитьТаблицуПоЗаказамВПродажах(Товары.ВыгрузитьКолонку("ДокументПродажи"));
	Движения.Продажи.Записывать = Истина;
	Для Каждого ТекущаяСтрока Из Товары Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Подразделение = Подразделение;
		Движение.Склад = Склад;
		Движение.ДоговорКонтрагента = ДоговорКонтрагента;
		Движение.ДокументПродажи = ТекущаяСтрока.ДокументПродажи; //?(ЗначениеЗаполнено(ТекущаяСтрока.ДокументПродажи), ТекущаяСтрока.ДокументПродажи, Основание);
		Движение.ЗаказПокупателя = ТекущаяСтрока.ЗаказПокупателя;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
		Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
		Движение.СерияНоменклатуры = ТекущаяСтрока.СерияНоменклатуры;
		Движение.ЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения;         //#14300
		Движение.КоличествоВЕдиницахДокумента = -ТекущаяСтрока.Количество;	//#14300
		Движение.Количество = -ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;	
		Движение.Сумма = -РаботаСВалютой.ПересчитатьИзВалютыВВалюту(Валюта, ВалютаУчета, Дата, ТекущаяСтрока.Сумма);
		Движение.СуммаВал = -РаботаСВалютой.ПолучитьСуммуВДопВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма); //#8288
	КонецЦикла;
	
	//БонусыКонтрагентов
	Если СлужебныйВидБонуснойСистемы = Перечисления.ВидыБонусныхСистем.Внутренняя 
		И СуммаБонусовКНачислениюПоДисконтнойКарте > 0 
		И ((СлужебныйУчетБонусовПоДисконтнымКартам И НЕ ДисконтнаяКарта.Пустая())
		    ИЛИ НЕ СлужебныйУчетБонусовПоДисконтнымКартам) Тогда
		
		Движения.БонусыКонтрагентов.Записывать = Истина;

		Движение = Движения.БонусыКонтрагентов.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.ДисконтнаяКарта = ?(СлужебныйУчетБонусовПоДисконтнымКартам, ДисконтнаяКарта, Справочники.ДисконтныеКарты.ПустаяСсылка());
		Движение.Контрагент = Контрагент;
		Движение.Сумма = -СуммаБонусовКНачислениюПоДисконтнойКарте;
		
	КонецЕсли;
	
	// регистр ДоходыРасходы
	Если ПараметрыСеанса.ФинРезультатИспользоватьВедениеУчетаДоходовРасходов Тогда
		Если ПараметрыСеанса.ФинРезультатНеКассовыйМетодВеденияУчетаДоходовРасходов Тогда
			//некассовый метод			
			Метод = Перечисления.МетодыВеденияУчетаДоходовРасходов.Некассовый;
			Движения.ДоходыРасходы.Записывать = Истина;
			Для Каждого ТекущаяСтрока Из Товары Цикл
				Статья = ?(НЕ ТекущаяСтрока.СтатьяРасходов.Пустая(), ТекущаяСтрока.СтатьяРасходов, СтатьяРасходов);
				Если Статья.Пустая() ИЛИ ТекущаяСтрока.Сумма = 0 Тогда
					Продолжить;
				КонецЕсли;				
				Движение = Движения.ДоходыРасходы.Добавить();
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Подразделение 	= Подразделение;
				Движение.Статья 		= Статья;
				Движение.Метод		 	= Метод;
				Движение.СуммаДоходов 	= 0;
				Движение.СуммаРасходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма);				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	//++ №8749
	Движения.ЗаказыПокупателей.Записывать = Истина;
	Для Каждого ТекущаяСтрока Из Товары Цикл
		
		Если ТекущаяСтрока.ЗаказПокупателя.Пустая() 
			ИЛИ ТекущаяСтрока.КомпенсацияПоВозврату = Перечисления.ВариантыКомпенсацииПоВозврату.ЗачестьВернуть //#12822
			Тогда
			Продолжить;
		КонецЕсли;	
			
		Движение = Движения.ЗаказыПокупателей.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ЗаказНаПроизводство = ТекущаяСтрока.ЗаказПокупателя;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
		Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
		Движение.СерияНоменклатуры = ТекущаяСтрока.СерияНоменклатуры;
		Движение.Количество = -(ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент);
		Движение.Сумма = -(ТекущаяСтрока.Сумма + ТекущаяСтрока.БонусыКНачислению); //#9777, #10397
		
	КонецЦикла;
	
	// РасчетыПоЗаказам
	Движения.РасчетыПоЗаказам.Записывать = Истина;
	СписокВидовДокументовПоКоторымВедутсяРасчеты = ОбщийМодуль.ПолучитьМассивТиповДокументовПоКоторымВедутсяРасчетыПоЗаказам();
	
	//#12822 убрано движение  #15471 возвращено с допусловием
	Если НЕ СписокВидовДокументовПоКоторымВедутсяРасчеты.Найти(Тип("ДокументСсылка.РеализацияТоваровИУслуг")) = Неопределено Тогда
		Для Каждого ТекущаяСтрока из Товары Цикл			
			Если НЕ ТекущаяСтрока.ДокументПродажи.Пустая()
				И НЕ ТекущаяСтрока.ЗаказПокупателя.Пустая()
				И ТекущаяСтрока.КомпенсацияПоВозврату = Перечисления.ВариантыКомпенсацииПоВозврату.ОтгрузитьПовторно  //#15471
				Тогда				
				Движение = Движения.РасчетыПоЗаказам.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период 	 = Дата;
				Движение.Заказ 		 = ТекущаяСтрока.ДокументПродажи;			
				Движение.Контрагент  = Контрагент;
				Движение.Сумма 		 = ТекущаяСтрока.Сумма;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//++ #12822 в таблице указываются заказы, которые будут созданы после возврата
	// и данная таблица выступает как зачет оплаты	
	Для Каждого ТекущаяСтрока Из ЗачетАванса Цикл
		Если ТекущаяСтрока.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныйВидДокумента = СписокВидовДокументовПоКоторымВедутсяРасчеты.Найти(ТипЗнч(ТекущаяСтрока.Документ));
		Если НайденныйВидДокумента = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.РасчетыПоЗаказам.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Заказ = ТекущаяСтрока.Документ;
		Движение.Контрагент = Контрагент;
		Если ТекущаяСтрока.Документ.Валюта = Валюта ИЛИ ТекущаяСтрока.СуммаВВалютеДокумента = 0 Тогда 
			Движение.Сумма = ТекущаяСтрока.Сумма;
		Иначе
			Движение.Сумма = ТекущаяСтрока.СуммаВВалютеДокумента; 
		КонецЕсли; 
		
	КонецЦикла;
	//-- #12822
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
	Если ПолучитьФункциональнуюОпцию("УчетБонусов") Тогда
		СлужебныйУчитыватьБонусы 				= Константы.УчитыватьБонусы.Получить();
		СлужебныйУчетБонусовПоДисконтнымКартам 	= Константы.УчетБонусовПоДисконтнымКартам.Получить();
		СлужебныйВидБонуснойСистемы 			= Константы.ВидБонуснойСистемы.Получить();
	КонецЕсли;
		
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()

	// Склад по умолчанию из настроек текущего пользователя (реквизит "Склад" справочника Пользователи).
	// Имеет приоритет, в том числе при вводе на основании; если у пользователя склад не задан,
	// остаётся склад из документа-основания.
	РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("Склад");
	Если ЗначениеЗаполнено(РеквизитыПользователя.Склад) Тогда
		Склад = РеквизитыПользователя.Склад;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПоРеализации(ДанныеЗаполнения)
	
	Основание 			= ДанныеЗаполнения.Ссылка;
	Валюта 				= ДанныеЗаполнения.Валюта;
	Организация 		= ДанныеЗаполнения.Организация;
	Контрагент 			= ДанныеЗаполнения.Контрагент;
	ДоговорКонтрагента 	= ДанныеЗаполнения.ДоговорКонтрагента;
	Склад 				= ДанныеЗаполнения.Склад;
	Подразделение 		= ДанныеЗаполнения.Подразделение;
	ДисконтнаяКарта 	= ДанныеЗаполнения.ДисконтнаяКарта;
	ЗаполнитьТабличнуюЧастьПоОснованию(ДанныеЗаполнения)
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения)
	
	Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказа(ДанныеЗаполнения);
	
	Основание = ДанныеЗаполнения;
	Организация = ДанныеЗаполнения.Организация;
	Контрагент = ДанныеЗаполнения.Контрагент;
	ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
	Склад = ДанныеЗаполнения.Склад;
	Подразделение = ДанныеЗаполнения.Подразделение;
	ЗаполнитьТабличнуюЧастьПоОснованию(ДанныеЗаполнения);
	
	ЗаполнитьДокументыПродажиПоПоследнимПродажамНаСервере(ДанныеЗаполнения); // №14054
	
КонецПроцедуры

Процедура ЗаполнитьПоПКО(ДанныеЗаполнения)
	
	Если НЕ ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ОплатаОтПокупателя Тогда
		ВызватьИсключение "Не предусмотрен ввод на основании документа с этим видом операции";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Документ ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА 2
	|		КОГДА ДанныеДокумента.Документ ССЫЛКА Документ.РеализацияТоваровИУслуг
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.РаспределениеПлатежа КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|	И (ДанныеДокумента.Документ ССЫЛКА Документ.ЗаказПокупателя
	|			ИЛИ ДанныеДокумента.Документ ССЫЛКА Документ.РеализацияТоваровИУслуг)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет
	|ИТОГИ
	|	КОЛИЧЕСТВО(Документ)
	|ПО
	|	Приоритет";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() тогда
		ТекстОшибки = "В распределении отсутствуют документы типа ""Заказ покупателя"" / ""Реализация товаров и услуг""";
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ВыборкаТипов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ЕстьРеализации = Ложь;	
	Пока ВыборкаТипов.Следующий() Цикл
		Если НЕ ЕстьРеализации И ВыборкаТипов.Приоритет = 1 Тогда
			ЕстьРеализации = Истина;
		КонецЕсли;
		Если ЕстьРеализации И ВыборкаТипов.Приоритет = 2 Тогда
			Прервать;
		КонецЕсли;
		
		Выборка = ВыборкаТипов.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ВыборкаТипов.Приоритет = 1 Тогда
				ЗаполнитьПоРеализации(Выборка.Документ);
			ИначеЕсли ВыборкаТипов.Приоритет = 2 Тогда
				ЗаполнитьПоЗаказуПокупателя(Выборка.Документ);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьПоОснованию(ДанныеЗаполнения) Экспорт
	
	СтавкаНДСПоУмолчанию = УчетНДС.СтавкаНДСПоУмолчанию(Организация);
	УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Организация);
	
	СпособКомпенсацииПоВозвратуТоваровОтПокупателя = ОбщийМодульСервер.ПолучитьСпособКомпенсацииПоВозвратуТоваровОтПокупателя();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		
		//#13323
		// - не берем из регистров, все брать из документа-основания в том виде как есть. цену пересчитываем как сумма / количество
		// - не учитываем возможные возвраты, которые выполнены ранее: пользователь сам принимает решение по количеству
		Для Каждого ТекущаяСтрока Из ДанныеЗаполнения.Товары Цикл
			
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			
			НоваяСтрока.БонусыКНачислению = ТекущаяСтрока.СкидкаБонусами;
			НоваяСтрока.ДокументПродажи = ДанныеЗаполнения;
			НоваяСтрока.ЗаказПокупателя = ТекущаяСтрока.Заказ;
			
			//++ №13812 в сумме закладываем скидку бонусами, чтобы цена была как в основании
			//НоваяСтрока.Цена = ?(НоваяСтрока.Количество = 0, НоваяСтрока.Цена, НоваяСтрока.Сумма / НоваяСтрока.Количество);
			НоваяСтрока.Цена = ?(НоваяСтрока.Количество = 0, НоваяСтрока.Цена, (НоваяСтрока.Сумма + ТекущаяСтрока.СкидкаБонусами) / НоваяСтрока.Количество);
			//-- №13812
		
			НоваяСтрока.ВариантОпределенияСебестоимости = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи;		
			
			Если ЗначениеЗаполнено(НоваяСтрока.ЗаказПокупателя) Тогда
				НоваяСтрока.КомпенсацияПоВозврату = СпособКомпенсацииПоВозвратуТоваровОтПокупателя;
			КонецЕсли;
			
		КонецЦикла;
		
		//#13323 - весь текст ниже закомментирован
		
		////заполнение по остаткам
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	ПродажиОбороты.Номенклатура КАК Номенклатура,
		//|	ПродажиОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		//|	ПродажиОбороты.СерияНоменклатуры КАК СерияНоменклатуры,
		//|	ПродажиОбороты.ДокументПродажи КАК ДокументПродажи,
		//|	ЕСТЬNULL(ПродажиОбороты.ЗаказПокупателя, ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)) КАК ЗаказПокупателя,
		//|	СУММА(ПродажиОбороты.КоличествоОборот) КАК Количество
		//|ПОМЕСТИТЬ ВТ
		//|ИЗ
		//|	РегистрНакопления.Продажи.Обороты(, , Регистратор, ) КАК ПродажиОбороты
		//|ГДЕ
		//|	ПродажиОбороты.Регистратор <> &Регистратор
		//|	И ПродажиОбороты.ДокументПродажи = &ДокументПродажи
		////++ #13232
		//|	И НЕ ПродажиОбороты.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга)
		////-- #13232
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ПродажиОбороты.Номенклатура,
		//|	ПродажиОбороты.ХарактеристикаНоменклатуры,
		//|	ПродажиОбороты.СерияНоменклатуры,
		//|	ПродажиОбороты.ДокументПродажи,
		//|	ПродажиОбороты.ЗаказПокупателя
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ.Номенклатура КАК Номенклатура,
		//|	ВТ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		//|	ВТ.СерияНоменклатуры КАК СерияНоменклатуры,
		//|	ВТ.ДокументПродажи КАК ДокументПродажи,
		//|	ВТ.ЗаказПокупателя КАК ЗаказПокупателя,
		//|	ВТ.Количество КАК Количество
		//|ИЗ
		//|	ВТ КАК ВТ
		//|ГДЕ
		//|	ВТ.Количество > 0";
		//
		//Запрос.УстановитьПараметр("Регистратор", Ссылка);
		//Запрос.УстановитьПараметр("ДокументПродажи", ДанныеЗаполнения);
		//ТаблицаПродаж = Запрос.Выполнить().Выгрузить();
		//
		//ТаблицаРеализации = ДанныеЗаполнения.Товары.Выгрузить();
		//Для Каждого СтрокаТабличнойЧасти Из ТаблицаРеализации Цикл
		//	
		//	Отбор = Новый Структура;
		//	Отбор.Вставить("Номенклатура", 				 СтрокаТабличнойЧасти.Номенклатура);
		//	Отбор.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
		//	Отбор.Вставить("СерияНоменклатуры", 		 СтрокаТабличнойЧасти.СерияНоменклатуры);
		//	Отбор.Вставить("ЗаказПокупателя", 		 	 ?(СтрокаТабличнойЧасти.Заказ=НЕОПРЕДЕЛЕНО,Документы.ЗаказПокупателя.ПустаяСсылка(),СтрокаТабличнойЧасти.Заказ)); // №11033 могут быть разные заказы
		//	
		//	//++ №11033 сначала проверим, может уже добавили в ТЧ позицию по таким ключам (чтобы исключить ситуацию, когда в реализации указано две строки с одинаковыми позициями)
		//	НайденныеСтроки = Товары.НайтиСтроки(Отбор);
		//	Если НайденныеСтроки.Количество() > 0 Тогда
		//		Продолжить;
		//	КонецЕсли;
		//	//-- №11033
		//	
		//	НайденныеСтроки = ТаблицаПродаж.НайтиСтроки(Отбор);
		//	Если НайденныеСтроки.Количество() > 0 Тогда
		//		
		//		НоваяСтрока = Товары.Добавить();
		//		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
		//		
		//		НоваяСтрока.БонусыКНачислению = СтрокаТабличнойЧасти.СкидкаБонусами;
		//		НоваяСтрока.ЗаказПокупателя = НайденныеСтроки[0].ЗаказПокупателя;
		//		НоваяСтрока.ДокументПродажи = ДанныеЗаполнения;
		//		НоваяСтрока.Количество = НайденныеСтроки[0].Количество / НоваяСтрока.Коэффициент;
		//		НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
		//		НоваяСтрока.ВариантОпределенияСебестоимости = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи;
		//		НоваяСтрока.СтавкаНДС = СтавкаНДСПоУмолчанию;
		//		ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуНДСВСтрокеТЧ(НоваяСтрока, УчитыватьНДС);
		//		
		//		Если ЗначениеЗаполнено(НоваяСтрока.ЗаказПокупателя) Тогда
		//			НоваяСтрока.КомпенсацияПоВозврату = Перечисления.ВариантыКомпенсацииПоВозврату.ОтгрузитьПовторно;
		//		КонецЕсли;
		//	КонецЕсли;
		//	
		//КонецЦикла;	
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда 
		
		//#13323
		// - не берем из регистров, все брать из документа-основания в том виде как есть. цену пересчитываем как сумма / количество
		// - не учитываем возможные возвраты, которые выполнены ранее: пользователь сам принимает решение по количеству
		Для Каждого ТекущаяСтрока Из ДанныеЗаполнения.Товары Цикл
			
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			
			НоваяСтрока.БонусыКНачислению = ТекущаяСтрока.СкидкаБонусами;
			НоваяСтрока.ЗаказПокупателя = ДанныеЗаполнения;
			
			//++ №13812 в сумме закладываем скидку бонусами, чтобы цена была как в основании
			//НоваяСтрока.Цена = ?(НоваяСтрока.Количество = 0, НоваяСтрока.Цена, НоваяСтрока.Сумма / НоваяСтрока.Количество);
			НоваяСтрока.Цена = ?(НоваяСтрока.Количество = 0, НоваяСтрока.Цена, (НоваяСтрока.Сумма + ТекущаяСтрока.СкидкаБонусами) / НоваяСтрока.Количество);
			//-- №13812
			
			НоваяСтрока.ВариантОпределенияСебестоимости = ?(ЗначениеЗаполнено(НоваяСтрока.ДокументПродажи), Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи, Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.РучноеУказание);
			
			Если ЗначениеЗаполнено(НоваяСтрока.ЗаказПокупателя) Тогда
				НоваяСтрока.КомпенсацияПоВозврату = СпособКомпенсацииПоВозвратуТоваровОтПокупателя;
			КонецЕсли;
			
		КонецЦикла;
		
		//#13323 - весь текст ниже закомментирован
		
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	ПродажиОбороты.Номенклатура КАК Номенклатура,
		//|	ПродажиОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		//|	ПродажиОбороты.СерияНоменклатуры КАК СерияНоменклатуры,
		//|	ПродажиОбороты.ДокументПродажи КАК ДокументПродажи,
		//|	ПродажиОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
		//|	СУММА(ПродажиОбороты.КоличествоОборот) КАК Количество
		//|ПОМЕСТИТЬ ВТ
		//|ИЗ
		//|	РегистрНакопления.Продажи.Обороты(, , Регистратор, ) КАК ПродажиОбороты
		//|ГДЕ
		//|	ПродажиОбороты.Регистратор <> &Регистратор
		//|	И ПродажиОбороты.ЗаказПокупателя = &ЗаказПокупателя
		////++ #13232
		//|	И НЕ ПродажиОбороты.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.Услуга)
		////-- #13232
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ПродажиОбороты.Номенклатура,
		//|	ПродажиОбороты.ХарактеристикаНоменклатуры,
		//|	ПродажиОбороты.СерияНоменклатуры,
		//|	ПродажиОбороты.ДокументПродажи,
		//|	ПродажиОбороты.ЗаказПокупателя
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ.Номенклатура КАК Номенклатура,
		//|	ВТ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		//|	ВТ.СерияНоменклатуры КАК СерияНоменклатуры,
		//|	ВТ.ДокументПродажи КАК ДокументПродажи,
		//|	ВТ.ЗаказПокупателя КАК ЗаказПокупателя,
		//|	ВТ.Количество КАК Количество
		//|ИЗ
		//|	ВТ КАК ВТ
		//|ГДЕ
		//|	ВТ.Количество > 0";
		//
		//Запрос.УстановитьПараметр("Регистратор", Ссылка);
		//Запрос.УстановитьПараметр("ЗаказПокупателя", ДанныеЗаполнения);
		//ТаблицаПродаж = Запрос.Выполнить().Выгрузить();
		//
		//ТаблицаЗаказа = ДанныеЗаполнения.Товары.Выгрузить();
		//Для Каждого СтрокаТабличнойЧасти Из ТаблицаЗаказа Цикл
		//	
		//	Отбор = Новый Структура;
		//	Отбор.Вставить("Номенклатура", 				 СтрокаТабличнойЧасти.Номенклатура);
		//	Отбор.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
		//	Отбор.Вставить("СерияНоменклатуры", 		 СтрокаТабличнойЧасти.СерияНоменклатуры);
		//	
		//	//++ №11033 сначала проверим, может уже добавили в ТЧ позицию по таким ключам (чтобы исключить ситуацию, когда в заказе указано две строки с одинаковыми позициями)
		//	НайденныеСтроки = Товары.НайтиСтроки(Отбор);
		//	Если НайденныеСтроки.Количество() > 0 Тогда
		//		Продолжить;
		//	КонецЕсли;
		//	//-- №11033
		//	
		//	НайденныеСтроки = ТаблицаПродаж.НайтиСтроки(Отбор);
		//	Если НайденныеСтроки.Количество() > 0 Тогда
		//		НоваяСтрока = Товары.Добавить();
		//		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
		//		НоваяСтрока.ЗаказПокупателя = ДанныеЗаполнения;
		//		НоваяСтрока.ДокументПродажи = НайденныеСтроки[0].ДокументПродажи;
		//		НоваяСтрока.Количество = НайденныеСтроки[0].Количество / НоваяСтрока.Коэффициент;
		//		НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
		//		НоваяСтрока.ВариантОпределенияСебестоимости = ?(ЗначениеЗаполнено(НоваяСтрока.ДокументПродажи), Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи, Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.РучноеУказание);
		//		НоваяСтрока.СтавкаНДС = СтавкаНДСПоУмолчанию;
		//		ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуНДСВСтрокеТЧ(НоваяСтрока, УчитыватьНДС);
		//		
		//		Если ЗначениеЗаполнено(НоваяСтрока.ЗаказПокупателя) Тогда
		//			НоваяСтрока.КомпенсацияПоВозврату = Перечисления.ВариантыКомпенсацииПоВозврату.ОтгрузитьПовторно;
		//		КонецЕсли;
		//	КонецЕсли;
		//	
		//КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

Функция ПолучитьСуммуЗачета() Экспорт
	
	СуммаЗачета = 0;
	Для каждого СтрокаТЧ из Товары Цикл
		Если СтрокаТЧ.КомпенсацияПоВозврату = ПредопределенноеЗначение("Перечисление.ВариантыКомпенсацииПоВозврату.ЗачестьВернуть")
			//#15885
			ИЛИ СтрокаТЧ.КомпенсацияПоВозврату = Перечисления.ВариантыКомпенсацииПоВозврату.ПустаяСсылка() Тогда
			СуммаЗачета = СуммаЗачета + СтрокаТЧ.Сумма;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат СуммаЗачета;
	
КонецФункции

Функция ПолучитьТаблицуПоЗаказамВПродажах(МассивРеализаций)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Продажи.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	Продажи.ЗаказПокупателя КАК ЗаказПокупателя,
	|	Продажи.Номенклатура КАК Номенклатура,
	|	Продажи.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Продажи.СерияНоменклатуры КАК СерияНоменклатуры,
	|	Продажи.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Регистратор В(&МассивРеализаций)";
	
	Запрос.УстановитьПараметр("МассивРеализаций", МассивРеализаций);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

//++ №14054 перенесено и адаптировано из модуля формы
Процедура ЗаполнитьДокументыПродажиПоПоследнимПродажамНаСервере(ЗаказПокупателя = Неопределено) Экспорт
	
	Если Товары.Количество() = 0 Тогда
		Сообщить("Табличная часть пустая");
		Возврат;
	КонецЕсли;
	
	УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Организация);
	СтавкаНДСПоУмолчанию = УчетНДС.СтавкаНДСПоУмолчанию(Организация);
	
	ТаблицаРаспределенных = Товары.Выгрузить();
	КоличествоРаспределенных = ТаблицаРаспределенных.Количество();
	
	// для уменьшения количества распределения
	Для Индекс = 1 по КоличествоРаспределенных Цикл
		СтрокаТаблицы = ТаблицаРаспределенных[КоличествоРаспределенных - Индекс];	
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ЗаказПокупателя) ИЛИ НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДокументПродажи) Тогда
			 ТаблицаРаспределенных.Удалить(СтрокаТаблицы);			
		КонецЕсли;
	КонецЦикла;
		
	//МассивНоменклатуры = Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура");
	//Если МассивНоменклатуры.Количество() = 0 Тогда
	//	Сообщить("Табличная часть пустая");
	//	Возврат;
	//КонецЕсли;
	// #15886 переделано на таблицу
	ТаблицаДанных = Товары.Выгрузить(, "НомерСтроки, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЗаказПокупателя, ДокументПродажи");
	
	ТаблицаРаспределения = Новый ТаблицаЗначений;
	ТаблицаРаспределения.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаРаспределения.Колонки.Добавить("Номенклатура");
	ТаблицаРаспределения.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаРаспределения.Колонки.Добавить("СерияНоменклатуры");
	ТаблицаРаспределения.Колонки.Добавить("ДокументПродажи");
	ТаблицаРаспределения.Колонки.Добавить("ЗаказПокупателя");
	ТаблицаРаспределения.Колонки.Добавить("Количество");
	ТаблицаРаспределения.Колонки.Добавить("Цена");
	ТаблицаРаспределения.Колонки.Добавить("Бонусы");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент",  Контрагент);
	//Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	
	//#13323
	//Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Ссылка), Дата, КонецДня(ТекущаяДатаСеанса())));
	
	//++ №14054 если заполняем по заказу покупателя, то документы продажи отбираем по этому заказу
	Запрос.УстановитьПараметр("ОтборПоЗаказу", ЗначениеЗаполнено(ЗаказПокупателя));
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	//-- №14054
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДанных.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДанных.Номенклатура КАК Номенклатура,
	|	ТаблицаДанных.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаДанных.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ТаблицаДанных.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаДанных.ДокументПродажи КАК ДокументПродажи
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.НомерСтроки КАК НомерСтроки,
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ.СерияНоменклатуры КАК СерияНоменклатуры
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	(ВТ.ДокументПродажи = ЗНАЧЕНИЕ(Документ.РеализацияТоваровИУслуг.ПустаяСсылка)
	|			ИЛИ ВТ.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.НомерСтроки КАК НомерСтроки,
	|	Продажи.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(Продажи.ХарактеристикаНоменклатуры, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(Продажи.СерияНоменклатуры, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК СерияНоменклатуры,
	|	Продажи.Регистратор КАК Регистратор,
	|	Продажи.ЗаказПокупателя КАК ЗаказПокупателя,
	|	Продажи.Период КАК Период,
	|	Продажи.Количество КАК Количество,
	|	Продажи.Сумма / Продажи.Количество КАК ЦенаПродажи
	|ПОМЕСТИТЬ ВТ_Продажи
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	|		ПО (ВТ.Номенклатура = Продажи.Номенклатура)
	|			И (ВТ.ХарактеристикаНоменклатуры = Продажи.ХарактеристикаНоменклатуры)
	|			И (ВТ.СерияНоменклатуры = Продажи.СерияНоменклатуры)
	|ГДЕ
	|	Продажи.Период < &Дата
	|	И Продажи.Организация = &Организация
	|	И Продажи.Контрагент = &Контрагент
	|	И (ТИПЗНАЧЕНИЯ(Продажи.Регистратор) = ТИП(Документ.РеализацияТоваровИУслуг)
	|			ИЛИ ТИПЗНАЧЕНИЯ(Продажи.Регистратор) = ТИП(Документ.ВозвратТовараОтПокупателя))
	|	И ВЫБОР
	|			КОГДА &ОтборПоЗаказу
	|				ТОГДА Продажи.ЗаказПокупателя = &ЗаказПокупателя
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Продажи.НомерСтроки КАК НомерСтроки,
	|	ВТ_Продажи.Номенклатура КАК Номенклатура,
	|	ВТ_Продажи.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_Продажи.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВТ_Продажи.Период КАК Период,
	|	ВТ_Продажи.Регистратор КАК Регистратор,
	|	ВТ_Продажи.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВТ_Продажи.Количество КАК Количество,
	|	ВТ_Продажи.ЦенаПродажи КАК ЦенаПродажи
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Продажи.Период УБЫВ
	|ИТОГИ ПО
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	СерияНоменклатуры";
	
	ВыборкаНоменклатура = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Номенклатура");
	Пока ВыборкаНоменклатура.Следующий() Цикл
		ВыборкаХарактеристика = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ХарактеристикаНоменклатуры");
		Пока ВыборкаХарактеристика.Следующий() Цикл
			ВыборкаСерия = ВыборкаХарактеристика.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СерияНоменклатуры");
			Пока ВыборкаСерия.Следующий() Цикл
				
				ПараметрыОтбораСтрок = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры", ВыборкаНоменклатура.Номенклатура, ВыборкаХарактеристика.ХарактеристикаНоменклатуры, ВыборкаСерия.СерияНоменклатуры);		
				НайденныеСтроки = Товары.НайтиСтроки(ПараметрыОтбораСтрок);
				Если НайденныеСтроки.Количество() > 0 Тогда
					
					НакоплениеОбщее 	 = 0;
					ОстатокРаспределения = 0;
					НакоплениеПродажа 	 = 0;
					// определяем какое количество номенклатуры надо распределить по продажам
					Для каждого ЭлементМассива из НайденныеСтроки Цикл
						// оставляем только те строки где заполнен и заказ, и реализация	
						Если НЕ ЗначениеЗаполнено(ЭлементМассива.ЗаказПокупателя) ИЛИ НЕ ЗначениеЗаполнено(ЭлементМассива.ДокументПродажи) Тогда
							ОстатокРаспределения = ОстатокРаспределения + ЭлементМассива.Количество;
						КонецЕсли;
					КонецЦикла;
					// если распределять нечего, то идем дальше
					Если ОстатокРаспределения = 0 Тогда				
						Прервать;				
					КонецЕсли;
					
					ВыборкаПродаж = ВыборкаСерия.Выбрать();
					Пока ВыборкаПродаж.Следующий() Цикл
						НакоплениеОбщее = НакоплениеОбщее + ВыборкаПродаж.Количество;
						
						ВыборкаПродажКоличество = ВыборкаПродаж.Количество;
						// проверим уже распределенные в документе
						// на это количество уменьшим
						КоличествоРаспределенных = ТаблицаРаспределенных.Количество();
						Для Индекс = 1 по КоличествоРаспределенных Цикл
							СтрокаТаблицы = ТаблицаРаспределенных[КоличествоРаспределенных - Индекс];						
							Если СтрокаТаблицы.Номенклатура = ВыборкаНоменклатура.Номенклатура 
								И СтрокаТаблицы.ХарактеристикаНоменклатуры = ВыборкаХарактеристика.ХарактеристикаНоменклатуры 
								И СтрокаТаблицы.СерияНоменклатуры = ВыборкаСерия.СерияНоменклатуры 
								И СтрокаТаблицы.ДокументПродажи =  ВыборкаПродаж.Регистратор 
								И СтрокаТаблицы.ЗаказПокупателя = ВыборкаПродаж.ЗаказПокупателя Тогда		
								
								КоличествоУменьшения = Мин(СтрокаТаблицы.Количество, ВыборкаПродажКоличество);	
								СтрокаТаблицы.Количество = СтрокаТаблицы.Количество - КоличествоУменьшения;
								ВыборкаПродажКоличество  = ВыборкаПродажКоличество - КоличествоУменьшения;
							КонецЕсли;
							Если СтрокаТаблицы.Количество = 0 Тогда
								ТаблицаРаспределенных.Удалить(СтрокаТаблицы);
							КонецЕсли;							
						КонецЦикла;
												
						Если НакоплениеОбщее > 0 И ВыборкаПродажКоличество > 0 Тогда
							// возможно использование документа
							КоличествоРаспределения = Мин(ОстатокРаспределения, НакоплениеОбщее, ВыборкаПродажКоличество);
							
							НоваяСтрокаРаспределения = ТаблицаРаспределения.Добавить();
							НоваяСтрокаРаспределения.НомерСтроки = ВыборкаПродаж.НомерСтроки;
							НоваяСтрокаРаспределения.Номенклатура = ВыборкаНоменклатура.Номенклатура;
							НоваяСтрокаРаспределения.ХарактеристикаНоменклатуры = ВыборкаХарактеристика.ХарактеристикаНоменклатуры;
							НоваяСтрокаРаспределения.СерияНоменклатуры = ВыборкаСерия.СерияНоменклатуры;		
							
							НоваяСтрокаРаспределения.ДокументПродажи = ВыборкаПродаж.Регистратор;
							НоваяСтрокаРаспределения.ЗаказПокупателя = ВыборкаПродаж.ЗаказПокупателя;
							НоваяСтрокаРаспределения.Количество = КоличествоРаспределения;
							НоваяСтрокаРаспределения.Цена = ВыборкаПродаж.ЦенаПродажи; 							
							
							ОстатокРаспределения = ОстатокРаспределения - КоличествоРаспределения;
							
						КонецЕсли;
						
						Если ОстатокРаспределения <= 0 Тогда				
							Прервать;				
						КонецЕсли;	
					КонецЦикла;
				Иначе
					// не сошлись характеристики или серии, ничего не делаем
					Продолжить;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	
	Если ТаблицаРаспределения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьБонусыКВозврату(ТаблицаРаспределения);
	
	ТаблицаРезультата = Товары.Выгрузить();
	ТоварыТЧ = Товары.Выгрузить();
	ТоварыТЧ.Очистить();

	//ТаблицаРезультата.Очистить();
	КоличествоРаспределенных = ТаблицаРезультата.Количество();
	Для Индекс = 1 по КоличествоРаспределенных Цикл
		СтрокаТаблицы = ТаблицаРезультата[КоличествоРаспределенных - Индекс];	
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ЗаказПокупателя) ИЛИ НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДокументПродажи) Тогда
			
			НоваяСтрока = ТоварыТЧ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			
			ТаблицаРезультата.Удалить(СтрокаТаблицы);
				
		КонецЕсли;
	КонецЦикла;
	
	ТоварыТЧ.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Коэффициент", "Количество");
	
	Для каждого СтрокаТЧ из ТоварыТЧ Цикл
		ПараметрыОтбораСтрок = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры", СтрокаТЧ.Номенклатура, СтрокаТЧ.ХарактеристикаНоменклатуры, СтрокаТЧ.СерияНоменклатуры);		
		НайденныеСтроки = ТаблицаРаспределения.НайтиСтроки(ПараметрыОтбораСтрок);
		Если НайденныеСтроки.Количество() > 0 Тогда
			КоличествоКРаспределению = СтрокаТЧ.Количество;
			Для каждого ЭлементМассива из НайденныеСтроки Цикл
				НоваяСтрока = ТаблицаРезультата.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
				НоваяСтрока.НомерСтроки 		= ЭлементМассива.НомерСтроки; // #15886
				НоваяСтрока.ДокументПродажи 	= ЭлементМассива.ДокументПродажи;
				НоваяСтрока.ЗаказПокупателя 	= ЭлементМассива.ЗаказПокупателя;
				НоваяСтрока.Количество 			= ЭлементМассива.Количество;
				НоваяСтрока.Цена 				= ЭлементМассива.Цена;
				НоваяСтрока.Сумма 				= ЭлементМассива.Количество * ЭлементМассива.Цена;
				НоваяСтрока.БонусыКНачислению 	= ЭлементМассива.Бонусы; 
				КоличествоКРаспределению 		= КоличествоКРаспределению - НоваяСтрока.Количество;	
				НоваяСтрока.ВариантОпределенияСебестоимости = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи;
				ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(НоваяСтрока, УчитыватьНДС);
			КонецЦикла;
			
			// не все распределилось по документам
			Если КоличествоКРаспределению > 0 Тогда
				НоваяСтрока = ТаблицаРезультата.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
				НоваяСтрока.Количество = КоличествоКРаспределению;
				НоваяСтрока.Сумма = 0;
				НоваяСтрока.Цена = 0;
				НоваяСтрока.ВариантОпределенияСебестоимости = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.РучноеУказание;
				ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(НоваяСтрока, УчитыватьНДС);
			КонецЕсли;
		Иначе
			НоваяСтрока = ТаблицаРезультата.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			НоваяСтрока.ВариантОпределенияСебестоимости = Перечисления.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи;
			ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(НоваяСтрока, УчитыватьНДС);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаРезультата.Сортировать("НомерСтроки"); // #15886
	Товары.Загрузить(ТаблицаРезультата);
	
	//#13323
	Для каждого СтрокаТабличнойЧасти из Товары Цикл
		
		//++ №13856 способ компенсации смотрим по настройкам
		//СтрокаТабличнойЧасти.КомпенсацияПоВозврату = Перечисления.ВариантыКомпенсацииПоВозврату.ОтгрузитьПовторно;
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ЗаказПокупателя) Тогда
			СтрокаТабличнойЧасти.КомпенсацияПоВозврату = ОбщийМодульСервер.ПолучитьСпособКомпенсацииПоВозвратуТоваровОтПокупателя();
		Иначе
			СтрокаТабличнойЧасти.КомпенсацияПоВозврату = ПредопределенноеЗначение("Перечисление.ВариантыКомпенсацииПоВозврату.ПустаяСсылка");	
		КонецЕсли;
		//-- №13856
		
		СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
		
		ОбработкаТабличныхЧастейКлиентСервер.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);	
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьБонусыКВозврату(ТаблицаРаспределенияПоПродажам)
	
	МассивРегистраторов = ТаблицаРаспределенияПоПродажам.ВыгрузитьКолонку("ДокументПродажи"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеализацияТоваровИУслугТовары.Номенклатура,
		|	РеализацияТоваровИУслугТовары.ХарактеристикаНоменклатуры,
		|	РеализацияТоваровИУслугТовары.СерияНоменклатуры,
		|	СУММА(РеализацияТоваровИУслугТовары.Количество) КАК Количество,
		|	СУММА(РеализацияТоваровИУслугТовары.Сумма) КАК Сумма,
		|	СУММА(РеализацияТоваровИУслугТовары.СкидкаБонусами) КАК СкидкаБонусами
		|ИЗ
		|	Документ.РеализацияТоваровИУслуг.Товары КАК РеализацияТоваровИУслугТовары
		|ГДЕ
		|	РеализацияТоваровИУслугТовары.Ссылка В(&МассивРегистраторов)
		|	И РеализацияТоваровИУслугТовары.СкидкаБонусами > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровИУслугТовары.Номенклатура,
		|	РеализацияТоваровИУслугТовары.ХарактеристикаНоменклатуры,
		|	РеализацияТоваровИУслугТовары.СерияНоменклатуры";
	
	Запрос.УстановитьПараметр("МассивРегистраторов", МассивРегистраторов);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество > 0 Тогда
			Коэф = Выборка.СкидкаБонусами / Выборка.Количество;
			ПараметрыОтбораСтрок = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры", Выборка.Номенклатура, Выборка.ХарактеристикаНоменклатуры, Выборка.СерияНоменклатуры);		
			НайденныеСтроки = ТаблицаРаспределенияПоПродажам.НайтиСтроки(ПараметрыОтбораСтрок);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				НайденныеСтроки[0].Бонусы = Коэф * НайденныеСтроки[0].Количество;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
//-- №14054  

//nva+++
Функция ПревышенСрокВозврата()
	
	ПревышенСрокВозврата = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратТовараОтПокупателяТовары.Ссылка.Дата КАК ДатаВозврата,
		|	ВозвратТовараОтПокупателяТовары.ДокументПродажи.Дата КАК ДатаПродажи,
		|	РАЗНОСТЬДАТ(ВозвратТовараОтПокупателяТовары.ДокументПродажи.Дата, ВозвратТовараОтПокупателяТовары.Ссылка.Дата, ДЕНЬ) КАК ПрошлоДней,
		|	ВозвратТовараОтПокупателяТовары.НомерСтроки КАК НомерСтроки,
		|	ВозвратТовараОтПокупателяТовары.Номенклатура КАК Номенклатура
		|ИЗ
		|	Документ.ВозвратТовараОтПокупателя.Товары КАК ВозвратТовараОтПокупателяТовары
		|ГДЕ
		|	ВозвратТовараОтПокупателяТовары.Ссылка = &Ссылка
		|	И ВозвратТовараОтПокупателяТовары.ВариантОпределенияСебестоимости = ЗНАЧЕНИЕ(Перечисление.ВариантыОпределенияСебестоимостиПоВозвратам.ПоДокументуПродажи)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПрошлоДней > 14 Тогда
			ПревышенСрокВозврата = Истина;
			Сообщить("В строке с номером " + Выборка.НомерСтроки + " по номенклатуре " + Выборка.Номенклатура + " превышение срока возврата, с момента покупки прошло " + Выборка.ПрошлоДней + " дней!");
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ПревышенСрокВозврата;
	
КонецФункции	
//nva---

#КонецОбласти

#КонецЕсли
